-- tour DDL --

 DROP SCHEMA tourapi;
 CREATE SCHEMA tourapi;
 USE tourapi;
 
 
CREATE TABLE Accommodation(
	contentid      	INT,
	contenttypeid      VARCHAR(100),
	homepage           VARCHAR(500),
	tel                VARCHAR(100),
	title              VARCHAR(200),
	firstimage         VARCHAR(200),
	firstimage2        VARCHAR(200),
	areacode           VARCHAR(100),
	sigungucode        VARCHAR(100),
	cat1               VARCHAR(100),
	cat2               VARCHAR(100),
	cat3               VARCHAR(100),
	addr1              VARCHAR(500),
	addr2              VARCHAR(500),
    zipcode      		VARCHAR(100),
	mapx               VARCHAR(100),
	mapy               VARCHAR(100),
	overview           VARCHAR(3000),
	mlevel             VARCHAR(100),
	accomcountlodging   VARCHAR(100),
	benikia             VARCHAR(100),
	checkintime         VARCHAR(100),
	checkouttime        VARCHAR(100),
	chkcooking          VARCHAR(100),
	foodplace           VARCHAR(100),
	goodstay            VARCHAR(100),
	hanok               VARCHAR(100),
	infocenterlodging   VARCHAR(100),
	parkinglodging      VARCHAR(100),
	pickup              VARCHAR(100),
	roomcount           VARCHAR(100),
	reservationlodging  VARCHAR(100),
	reservationurl      VARCHAR(100),
	roomtype            VARCHAR(100),
	scalelodging        VARCHAR(100),
	subfacility         VARCHAR(100),
	barbecue            VARCHAR(100),
	beauty              VARCHAR(100),
	beverage            VARCHAR(100),
	bicycle             VARCHAR(100),
	campfire            VARCHAR(100),
	fitness             VARCHAR(100),
	karaoke             VARCHAR(100),
	publicbath          VARCHAR(100),
	publicpc            VARCHAR(100),
	sauna               VARCHAR(100),
	seminar             VARCHAR(100),
	sports              VARCHAR(100),
	refundregulation    VARCHAR(100),
	PRIMARY KEY (contentid)
);

DESC Accommodation;

select * from Accommodation;


 CREATE TABLE Restaurant(
	contentid      	INT,
	contenttypeid      VARCHAR(100),
	homepage           VARCHAR(500),
	tel                VARCHAR(100),
	title              VARCHAR(200),
	firstimage         VARCHAR(200),
	firstimage2        VARCHAR(200),
	areacode           VARCHAR(100),
	sigungucode        VARCHAR(100),
	cat1               VARCHAR(100),
	cat2               VARCHAR(100),
	cat3               VARCHAR(100),
	addr1              VARCHAR(500),
	addr2              VARCHAR(500),
    zipcode				VARCHAR(100),
	mapx               VARCHAR(100),
	mapy               VARCHAR(100),
	overview           VARCHAR(3000),
	mlevel             VARCHAR(100),
	chkcreditcardfood  VARCHAR(100),
	discountinfofood   VARCHAR(100),
	firstmenu         	VARCHAR(300),
	infocenterfood        VARCHAR(100),
	kidsfacility          VARCHAR(100),
	opendatefood           VARCHAR(200),
	opentimefood            VARCHAR(100),
	packing               VARCHAR(100),
	parkingfood  		 VARCHAR(100),
	reservationfood      VARCHAR(100),
	restdatefood              VARCHAR(200),
	scalefood           VARCHAR(100),
	seat  			VARCHAR(100),
	smoking      	VARCHAR(100),
	treatmenu            VARCHAR(500),
	lcnsno        VARCHAR(100),
	PRIMARY KEY (contentid)
);

DESC Restaurant;

select * from Restaurant;

 CREATE TABLE Tourspot(
	contentid      		INT,
	contenttypeid      VARCHAR(100),
	homepage           VARCHAR(500),
	tel                VARCHAR(100),
	title              VARCHAR(200),
	firstimage         VARCHAR(200),
	firstimage2        VARCHAR(200),
	areacode           VARCHAR(100),
	sigungucode        VARCHAR(100),
	cat1               VARCHAR(100),
	cat2               VARCHAR(100),
	cat3               VARCHAR(100),
	addr1              VARCHAR(500),
	addr2              VARCHAR(500),
    zipcode				VARCHAR(100),
	mapx               VARCHAR(100),
	mapy               VARCHAR(100),
	overview           VARCHAR(3000),
	mlevel             VARCHAR(100),
	accomcount  VARCHAR(100),
	chkbabycarriage   VARCHAR(100),
	chkcreditcard         	VARCHAR(100),
	chkpet        VARCHAR(100),
	expagerange          VARCHAR(100),
	expguide           VARCHAR(300),
	heritage1            VARCHAR(100),
	heritage2               VARCHAR(100),
	heritage3  		 VARCHAR(100),
	infocenter      VARCHAR(100),
	opendate              VARCHAR(200),
	parking           VARCHAR(100),
	restdate  			VARCHAR(200),
	useseason      	VARCHAR(100),
	usetime            VARCHAR(200),
	PRIMARY KEY (contentid)
);

DESC Tourspot;

select * from Tourspot;

CREATE TABLE TourImage(
	iNo 		INT AUTO_INCREMENT,
	contentid    int,
	imgname VARCHAR(1000),
	originimgurl VARCHAR(1000),
	smallimageurl VARCHAR(1000),
	PRIMARY KEY (iNo)
);

select * from TourImage;




------------------------------------------------
--------------- MEMBER 관련 테이블 ------------------
------------------------------------------------

CREATE TABLE MEMBER (
    mNO 	 INT  PRIMARY KEY AUTO_INCREMENT,
    ID 		 VARCHAR(30) NOT NULL UNIQUE,
    PASSWORD VARCHAR(100) NOT NULL,
    ROLE 	 VARCHAR(10) DEFAULT 'ROLE_USER',
    NAME 	 VARCHAR(15) NOT NULL,
    PHONE 	 VARCHAR(13),
    EMAIL 	 VARCHAR(100),
    ADDRESS  VARCHAR(100),
    KAKAOTOKEN	VARCHAR(1000),
    STATUS 	 VARCHAR(1) DEFAULT 'Y' CHECK(STATUS IN('Y', 'N')),
    ENROLL_DATE DATETIME  DEFAULT CURRENT_TIMESTAMP,
    MODIFY_DATE DATETIME DEFAULT CURRENT_TIMESTAMP
);



INSERT INTO MEMBER (
    mNO, 
    ID, 
    PASSWORD, 
    ROLE,
    NAME, 
    PHONE, 
    EMAIL, 
    ADDRESS, 
    KAKAOTOKEN,
    STATUS, 
    ENROLL_DATE, 
    MODIFY_DATE
) VALUES(
    0, 
    'admin', 
    '1234', 
    'ROLE_ADMIN', 
    '관리자', 
    '010-1234-4341', 
    'admin@test.com', 
    '서울시 강남구 역삼동',
    DEFAULT,
    DEFAULT,
    DEFAULT,
    DEFAULT
);

COMMIT;

SELECT * FROM MEMBER;



-------------------------------------------------
--------------- Board 관련 테이블 ------------------
-------------------------------------------------

CREATE TABLE BOARD (	
    bNO INT AUTO_INCREMENT,
    mNO INT, 
	TITLE VARCHAR(1000), 
	CONTENT VARCHAR(2000), 
	TYPE VARCHAR(100), 
	ORIGINAL_FILENAME VARCHAR(100), 
	RENAMED_FILENAME VARCHAR(100), 
	READCOUNT INT DEFAULT 0, 
    STATUS VARCHAR(1) DEFAULT 'Y' CHECK (STATUS IN('Y', 'N')),
    CREATE_DATE DATETIME  DEFAULT CURRENT_TIMESTAMP, 
    MODIFY_DATE DATETIME  DEFAULT CURRENT_TIMESTAMP,
    CONSTRAINT PK_BOARD_NO PRIMARY KEY(bNO),
    CONSTRAINT FK_BOARD_WRITER FOREIGN KEY(mNO) REFERENCES MEMBER(mNO) ON DELETE SET NULL
);


INSERT INTO `board` VALUES (1,1,'[판매] 애플 노트북 팔아요.','노트북 맥북 최신입니다. 게임하시면 안됩니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(2,1,'[판매] 삼성 노트북 팔아요.','삼성 노트북 팝니다. 터치 됩니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(3,1,'[판매] 아이폰 팔아요.','아이폰13 팝니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(4,1,'[판매] 갤럭시 팔아요.','갤럭시 플립3 팝니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(5,1,'[구매] 애플 노트북 삽니다.','맥북 게임용으로 삽니다. 이거 게임 잘돌아가나요?','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(6,1,'[구매] 삼성 노트북 삽니다.','삼성 노트북 삽니다. 아이폰 개발하려 삽니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(7,1,'[구매] 아이폰 삽니다.','아이폰3사요. 30만원에 네고합니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(8,1,'[구매] 갤럭시 삽니다.','갤럭시 삽니다. 아무 기종이나 상관없어요. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(9,1,'[판매] 애플 노트북 팔아요.','노트북 맥북 최신입니다. 게임하시면 안됩니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(10,1,'[판매] 삼성 노트북 팔아요.','삼성 노트북 팝니다. 터치 됩니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(11,1,'[판매] 아이폰 팔아요.','아이폰13 팝니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(12,1,'[판매] 갤럭시 팔아요.','갤럭시 플립3 팝니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(13,1,'[구매] 애플 노트북 삽니다.','맥북 게임용으로 삽니다. 이거 게임 잘돌아가나요?','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(14,1,'[구매] 삼성 노트북 삽니다.','삼성 노트북 삽니다. 아이폰 개발하려 삽니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(15,1,'[구매] 아이폰 삽니다.','아이폰3사요. 30만원에 네고합니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(16,1,'[구매] 갤럭시 삽니다.','갤럭시 삽니다. 아무 기종이나 상관없어요. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(17,1,'[판매] 애플 노트북 팔아요.','노트북 맥북 최신입니다. 게임하시면 안됩니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(18,1,'[판매] 삼성 노트북 팔아요.','삼성 노트북 팝니다. 터치 됩니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(19,1,'[판매] 아이폰 팔아요.','아이폰13 팝니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(20,1,'[판매] 갤럭시 팔아요.','갤럭시 플립3 팝니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(21,1,'[구매] 애플 노트북 삽니다.','맥북 게임용으로 삽니다. 이거 게임 잘돌아가나요?','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(22,1,'[구매] 삼성 노트북 삽니다.','삼성 노트북 삽니다. 아이폰 개발하려 삽니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(23,1,'[구매] 아이폰 삽니다.','아이폰3사요. 30만원에 네고합니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(24,1,'[구매] 갤럭시 삽니다.','갤럭시 삽니다. 아무 기종이나 상관없어요. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(25,1,'[판매] 애플 노트북 팔아요.','노트북 맥북 최신입니다. 게임하시면 안됩니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(26,1,'[판매] 삼성 노트북 팔아요.','삼성 노트북 팝니다. 터치 됩니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(27,1,'[판매] 아이폰 팔아요.','아이폰13 팝니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(28,1,'[판매] 갤럭시 팔아요.','갤럭시 플립3 팝니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(29,1,'[구매] 애플 노트북 삽니다.','맥북 게임용으로 삽니다. 이거 게임 잘돌아가나요?','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(30,1,'[구매] 삼성 노트북 삽니다.','삼성 노트북 삽니다. 아이폰 개발하려 삽니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(31,1,'[구매] 아이폰 삽니다.','아이폰3사요. 30만원에 네고합니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(32,1,'[구매] 갤럭시 삽니다.','갤럭시 삽니다. 아무 기종이나 상관없어요. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(33,1,'[판매] 애플 노트북 팔아요.','노트북 맥북 최신입니다. 게임하시면 안됩니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(34,1,'[판매] 삼성 노트북 팔아요.','삼성 노트북 팝니다. 터치 됩니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(35,1,'[판매] 아이폰 팔아요.','아이폰13 팝니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(36,1,'[판매] 갤럭시 팔아요.','갤럭시 플립3 팝니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(37,1,'[구매] 애플 노트북 삽니다.','맥북 게임용으로 삽니다. 이거 게임 잘돌아가나요?','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(38,1,'[구매] 삼성 노트북 삽니다.','삼성 노트북 삽니다. 아이폰 개발하려 삽니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(39,1,'[구매] 아이폰 삽니다.','아이폰3사요. 30만원에 네고합니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(40,1,'[구매] 갤럭시 삽니다.','갤럭시 삽니다. 아무 기종이나 상관없어요. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(41,1,'[판매] 애플 노트북 팔아요.','노트북 맥북 최신입니다. 게임하시면 안됩니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(42,1,'[판매] 삼성 노트북 팔아요.','삼성 노트북 팝니다. 터치 됩니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(43,1,'[판매] 아이폰 팔아요.','아이폰13 팝니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(44,1,'[판매] 갤럭시 팔아요.','갤럭시 플립3 팝니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(45,1,'[구매] 애플 노트북 삽니다.','맥북 게임용으로 삽니다. 이거 게임 잘돌아가나요?','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(46,1,'[구매] 삼성 노트북 삽니다.','삼성 노트북 삽니다. 아이폰 개발하려 삽니다.','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(47,1,'[구매] 아이폰 삽니다.','아이폰3사요. 30만원에 네고합니다. ','B1','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(48,1,'[구매] 갤럭시 삽니다.','갤럭시 삽니다. 아무 기종이나 상관없어요. ','B1','원본파일명.txt','변경된파일명.txt',1,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(49,1,'[판매] 애플 노트북 팔아요.','노트북 맥북 최신입니다. 게임하시면 안됩니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(50,1,'[판매] 삼성 노트북 팔아요.','삼성 노트북 팝니다. 터치 됩니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(51,1,'[판매] 아이폰 팔아요.','아이폰13 팝니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(52,1,'[판매] 갤럭시 팔아요.','갤럭시 플립3 팝니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(53,1,'[구매] 애플 노트북 삽니다.','맥북 게임용으로 삽니다. 이거 게임 잘돌아가나요?','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(54,1,'[구매] 삼성 노트북 삽니다.','삼성 노트북 삽니다. 아이폰 개발하려 삽니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(55,1,'[구매] 아이폰 삽니다.','아이폰3사요. 30만원에 네고합니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(56,1,'[구매] 갤럭시 삽니다.','갤럭시 삽니다. 아무 기종이나 상관없어요. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(57,1,'[판매] 애플 노트북 팔아요.','노트북 맥북 최신입니다. 게임하시면 안됩니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(58,1,'[판매] 삼성 노트북 팔아요.','삼성 노트북 팝니다. 터치 됩니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(59,1,'[판매] 아이폰 팔아요.','아이폰13 팝니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(60,1,'[판매] 갤럭시 팔아요.','갤럭시 플립3 팝니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(61,1,'[구매] 애플 노트북 삽니다.','맥북 게임용으로 삽니다. 이거 게임 잘돌아가나요?','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(62,1,'[구매] 삼성 노트북 삽니다.','삼성 노트북 삽니다. 아이폰 개발하려 삽니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(63,1,'[구매] 아이폰 삽니다.','아이폰3사요. 30만원에 네고합니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(64,1,'[구매] 갤럭시 삽니다.','갤럭시 삽니다. 아무 기종이나 상관없어요. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(65,1,'[판매] 애플 노트북 팔아요.','노트북 맥북 최신입니다. 게임하시면 안됩니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(66,1,'[판매] 삼성 노트북 팔아요.','삼성 노트북 팝니다. 터치 됩니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(67,1,'[판매] 아이폰 팔아요.','아이폰13 팝니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(68,1,'[판매] 갤럭시 팔아요.','갤럭시 플립3 팝니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(69,1,'[구매] 애플 노트북 삽니다.','맥북 게임용으로 삽니다. 이거 게임 잘돌아가나요?','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(70,1,'[구매] 삼성 노트북 삽니다.','삼성 노트북 삽니다. 아이폰 개발하려 삽니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(71,1,'[구매] 아이폰 삽니다.','아이폰3사요. 30만원에 네고합니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(72,1,'[구매] 갤럭시 삽니다.','갤럭시 삽니다. 아무 기종이나 상관없어요. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(73,1,'[판매] 애플 노트북 팔아요.','노트북 맥북 최신입니다. 게임하시면 안됩니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(74,1,'[판매] 삼성 노트북 팔아요.','삼성 노트북 팝니다. 터치 됩니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(75,1,'[판매] 아이폰 팔아요.','아이폰13 팝니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(76,1,'[판매] 갤럭시 팔아요.','갤럭시 플립3 팝니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(77,1,'[구매] 애플 노트북 삽니다.','맥북 게임용으로 삽니다. 이거 게임 잘돌아가나요?','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(78,1,'[구매] 삼성 노트북 삽니다.','삼성 노트북 삽니다. 아이폰 개발하려 삽니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(79,1,'[구매] 아이폰 삽니다.','아이폰3사요. 30만원에 네고합니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(80,1,'[구매] 갤럭시 삽니다.','갤럭시 삽니다. 아무 기종이나 상관없어요. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(81,1,'[판매] 애플 노트북 팔아요.','노트북 맥북 최신입니다. 게임하시면 안됩니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(82,1,'[판매] 삼성 노트북 팔아요.','삼성 노트북 팝니다. 터치 됩니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(83,1,'[판매] 아이폰 팔아요.','아이폰13 팝니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(84,1,'[판매] 갤럭시 팔아요.','갤럭시 플립3 팝니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(85,1,'[구매] 애플 노트북 삽니다.','맥북 게임용으로 삽니다. 이거 게임 잘돌아가나요?','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(86,1,'[구매] 삼성 노트북 삽니다.','삼성 노트북 삽니다. 아이폰 개발하려 삽니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(87,1,'[구매] 아이폰 삽니다.','아이폰3사요. 30만원에 네고합니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(88,1,'[구매] 갤럭시 삽니다.','갤럭시 삽니다. 아무 기종이나 상관없어요. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(89,1,'[판매] 애플 노트북 팔아요.','노트북 맥북 최신입니다. 게임하시면 안됩니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(90,1,'[판매] 삼성 노트북 팔아요.','삼성 노트북 팝니다. 터치 됩니다.','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(91,1,'[판매] 아이폰 팔아요.','아이폰13 팝니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(92,1,'[판매] 갤럭시 팔아요.','갤럭시 플립3 팝니다. ','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(93,1,'[구매] 애플 노트북 삽니다.','맥북 게임용으로 삽니다. 이거 게임 잘돌아가나요?','B2','원본파일명.txt','변경된파일명.txt',0,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(94,1,'[구매] 삼성 노트북 삽니다.','삼성 노트북 삽니다. 아이폰 개발하려 삽니다.','B2','원본파일명.txt','변경된파일명.txt',1,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(95,1,'[구매] 아이폰 삽니다.','아이폰3사요. 30만원에 네고합니다. ','B2','원본파일명.txt','변경된파일명.txt',1,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(96,1,'[구매] 갤럭시 삽니다.','갤럭시 삽니다. 아무 기종이나 상관없어요. ','B2','원본파일명.txt','변경된파일명.txt',4,'Y','2023-06-11 17:09:19','2023-06-11 17:09:19'),(97,1,'1234','1245',NULL,NULL,NULL,0,'Y','2023-06-11 18:09:54','2023-06-11 18:09:54'),(98,1,'1234','12324','on',NULL,NULL,0,'Y','2023-06-11 18:13:12','2023-06-11 18:13:12'),(99,1,'qwrqrw','qwrqwrqwrqwr ','B1',NULL,NULL,6,'Y','2023-06-11 18:14:30','2023-06-11 18:14:30'),(100,1,'erteter','ertert','B2',NULL,NULL,1,'Y','2023-06-11 18:15:27','2023-06-11 18:15:27'),(101,1,'여행후기 테스트','여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트\r\n여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트여행후기 테스트','B2',NULL,NULL,7,'Y','2023-06-11 18:16:03','2023-06-11 18:16:03'),(102,1,'imgtest','imgtest','B2','test1234.jpg','20230611_1828467040.jpg',25,'Y','2023-06-11 18:28:46','2023-06-11 18:28:46'),(103,1,'경주','황리단길','B2',NULL,NULL,8,'Y','2023-06-11 23:01:28','2023-06-11 23:01:28'),(104,1,'경주','황리단길','B2','화면 캡처 2023-06-11 231120.jpg','20230611_2311558600.jpg',9,'Y','2023-06-11 23:11:55','2023-06-11 23:11:55'),(105,1,'서울','종로','B2','익선동.jpg','20230611_2330214980.jpg',4,'Y','2023-06-11 23:30:21','2023-06-11 23:30:21'),(106,1,'한강','하늘','B2','화면 캡처 2023-06-11 233136.jpg','20230611_2332047401.jpg',6,'Y','2023-06-11 23:32:04','2023-06-11 23:32:04'),(107,1,'한강공원','풍선','B2','화면 캡처 2023-06-11 233353.jpg','20230611_2334002722.jpg',6,'Y','2023-06-11 23:34:00','2023-06-11 23:34:00'),(108,1,'ㅅㄷㄴㄱ','ㅂㅈㄷㄱ','B2','test1234.jpg','20230611_2348059613.jpg',1,'Y','2023-06-11 23:48:05','2023-06-11 23:48:05'),(109,1,'1234','1243','B2','화면 캡처 2023-06-11 233353.jpg','20230612_0007183530.jpg',2,'Y','2023-06-12 00:07:18','2023-06-12 00:07:18'),(110,1,'경주 황리단','경주 요석궁->대릉원 첨성->비단 거리->황리단길->황리 회덕가->호텔','B1','화면 캡처 2023-06-11 231120.jpg','20230612_0057387010.jpg',1,'Y','2023-06-12 00:57:38','2023-06-12 00:57:38'),(111,1,'한남동','엔다이브','B2',NULL,NULL,0,'Y','2023-06-12 00:58:28','2023-06-12 00:58:28'),(112,1,'한남동 카페','.','B1',NULL,NULL,0,'Y','2023-06-12 00:58:47','2023-06-12 00:58:47'),(113,1,'영도 스타벅스','.','B2',NULL,NULL,0,'Y','2023-06-12 00:59:16','2023-06-12 00:59:16'),(114,1,'영도 스타벅스',',','B1',NULL,NULL,0,'Y','2023-06-12 00:59:30','2023-06-12 00:59:30'),(115,1,'가평 계곡','.','B2',NULL,NULL,0,'Y','2023-06-12 01:01:46','2023-06-12 01:01:46'),(116,1,'가평 계곡','.','B1',NULL,NULL,0,'Y','2023-06-12 01:01:58','2023-06-12 01:01:58'),(117,1,'땅끝 마을 둘레길','.','B1',NULL,NULL,0,'Y','2023-06-12 01:02:27','2023-06-12 01:02:27'),(118,1,'대전 성심당','.','B1',NULL,NULL,0,'Y','2023-06-12 01:02:49','2023-06-12 01:02:49'),(119,1,'경희대 캠퍼스 투어','.','B2',NULL,NULL,0,'Y','2023-06-12 01:03:11','2023-06-12 01:03:11'),(120,1,'경희대 캠퍼스 투어','','B2',NULL,NULL,0,'Y','2023-06-12 01:03:26','2023-06-12 01:03:26'),(121,1,'경희대 캠퍼스 투어','','B1',NULL,NULL,0,'Y','2023-06-12 01:03:40','2023-06-12 01:03:40'),(122,1,'대부도 바닷길 펜션','.','B2',NULL,NULL,0,'Y','2023-06-12 01:04:29','2023-06-12 01:04:29'),(123,1,'대부도 바닷길 펜션','.','B1',NULL,NULL,1,'Y','2023-06-12 01:04:41','2023-06-12 01:04:41'),(124,1,'롯데타워 아쿠아리움','.','B1',NULL,NULL,0,'Y','2023-06-12 01:05:12','2023-06-12 01:05:12'),(125,1,'신라호텔 망고빙수','ㄴ','B2',NULL,NULL,0,'Y','2023-06-12 01:05:26','2023-06-12 01:05:26'),(126,1,'파주 출판단지',',','B1',NULL,NULL,0,'Y','2023-06-12 01:06:44','2023-06-12 01:06:44'),(127,1,'논산 딸기 축제','.','B2',NULL,NULL,0,'Y','2023-06-12 01:07:04','2023-06-12 01:07:04'),(128,1,'논산 딸기 축제','.','B2',NULL,NULL,0,'Y','2023-06-12 01:07:17','2023-06-12 01:07:17'),(129,1,'논산 딸기 축제','.','B1',NULL,NULL,3,'Y','2023-06-12 01:07:32','2023-06-12 01:07:32'),(130,1,'부여 백체의 고향 공포체험','.','B2',NULL,NULL,1,'Y','2023-06-12 01:08:07','2023-06-12 01:08:07'),(131,1,'부여 백제의 고향 공포체험','','B1',NULL,NULL,11,'Y','2023-06-12 01:08:42','2023-06-12 01:08:42'),(132,1,'영도 스타벅스',' 영도에 위치한 도심 속 바다 뷰가 보이는 카페 입니다.','B2','youngdo.jpg','20230612_0111191781.jpg',7,'Y','2023-06-12 01:11:19','2023-06-12 01:11:19'),(133,1,'한강 하늘','.','B2','123.jpg','20230612_0115496340.jpg',2,'Y','2023-06-12 01:15:49','2023-06-12 01:15:49'),(134,1,'.','.','B2','화면 캡처 2023-06-11 233136.jpg','20230612_0116305791.jpg',0,'Y','2023-06-12 01:16:30','2023-06-12 01:16:30'),(135,1,'.','.','B2','화면 캡처 2023-06-11 231120.jpg','20230612_0117130922.jpg',0,'Y','2023-06-12 01:17:13','2023-06-12 01:17:13'),(136,1,'.','.','B2','익선동.jpg','20230612_0117267943.jpg',0,'Y','2023-06-12 01:17:26','2023-06-12 01:17:26'),(137,1,'/','/','B2','화면 캡처 2023-06-11 231120.jpg','20230612_0118347184.jpg',0,'Y','2023-06-12 01:18:34','2023-06-12 01:18:34'),(138,1,'/','/','B2','화면 캡처 2023-06-11 231120.jpg','20230612_0118565915.jpg',0,'Y','2023-06-12 01:18:56','2023-06-12 01:18:56'),(139,1,'ㅇㅁㅀㅁㅇㅀㅎㅁ','ㅇㄹㅋㅎㅁㅇㅀㄻㅇ','B2','화면 캡처 2023-06-11 231120.jpg','20230612_0119301886.jpg',0,'Y','2023-06-12 01:19:30','2023-06-12 01:19:30'),(140,1,'ㄴㅇㄹㄴㅇ','ㄴㅇㄹㄴㅇ','B2','화면 캡처 2023-06-12 011959.jpg','20230612_0120262177.jpg',0,'Y','2023-06-12 01:20:26','2023-06-12 01:20:26'),(141,1,'ㅂㅈㄷ','ㅂㅈㄷㅈㅂㄷ','B2','gijang.jpg','20230612_0148439508.jpg',0,'Y','2023-06-12 01:48:43','2023-06-12 01:48:43'),(142,1,'ㅂㅈㄷ','ㅂㅈㄷ','B2','gijang.jpg','20230612_0149219109.jpg',0,'Y','2023-06-12 01:49:21','2023-06-12 01:49:21'),(143,1,'ㅂㅈㄷ','ㅂㅈㄷ','B2','ski.jpg','20230612_01505456910.jpg',0,'Y','2023-06-12 01:50:54','2023-06-12 01:50:54'),(144,1,'ㄷㄳ2345','23142134','B2','sungsimdang.jpg','20230612_01532292811.jpg',0,'Y','2023-06-12 01:53:22','2023-06-12 01:53:22'),(145,1,'ㅁㄴㅇㅁㄴㅇ','ㅁㄴㅇㅁㄴㅇ','B2','ski.jpg','20230612_01541774412.jpg',0,'Y','2023-06-12 01:54:17','2023-06-12 01:54:17'),(146,1,'ㅂㅈㄷㅈㅂ','ㄷㅂㅈㄷㅈㅂㄷ','B2','lotte.jpg','20230612_01561723913.jpg',0,'Y','2023-06-12 01:56:17','2023-06-12 01:56:17'),(147,1,'ㅁㄴㅇㄻㄴㅇㄹ','ㅈㅂㄷㄳㅎㄴㅇㄹ','B2','sakura.jpg','20230612_01573721714.jpg',0,'Y','2023-06-12 01:57:37','2023-06-12 01:57:37'),(148,1,'ㅈㅂㄷㅂㅈㄷ','ㅂㅈㄷㅂㅈㄷ','B2','camping.jpg','20230612_01592922715.jpg',0,'Y','2023-06-12 01:59:29','2023-06-12 01:59:29'),(149,1,'남양주 글램핑장','.','B2','camping.jpg','20230612_02002446216.jpg',0,'Y','2023-06-12 02:00:24','2023-06-12 02:00:24'),(150,1,'경주 황리단길','.','B2','화면 캡처 2023-06-12 011959.jpg','20230612_02004262317.jpg',0,'Y','2023-06-12 02:00:42','2023-06-12 02:00:42'),(151,1,'기장 바다뷰 카페','.','B2','gijang.jpg','20230612_02010271418.jpg',0,'Y','2023-06-12 02:01:02','2023-06-12 02:01:02'),(152,1,'신길동 루카스 커피','.','B2','coffe.jpg','20230612_02014711219.jpg',0,'Y','2023-06-12 02:01:47','2023-06-12 02:01:47'),(153,1,'부산 롯데월드','.','B2','lotte.jpg','20230612_02020779020.jpg',0,'Y','2023-06-12 02:02:07','2023-06-12 02:02:07'),(154,1,'지리산 스키장','.','B2','ski.jpg','20230612_02023211721.jpg',0,'Y','2023-06-12 02:02:32','2023-06-12 02:02:32'),(155,1,'영도 스타벅스','','B2','youngdo.jpg','20230612_02024742022.jpg',0,'Y','2023-06-12 02:02:47','2023-06-12 02:02:47'),(156,1,'성심당 부띠끄(케잌, 디저트)','.','B2','sungsimdang.jpg','20230612_02031896023.jpg',0,'Y','2023-06-12 02:03:18','2023-06-12 02:03:18'),(157,1,'성심당 부띠끄','.','B2','sungsimdang.jpg','20230612_02035435424.jpg',0,'Y','2023-06-12 02:03:54','2023-06-12 02:03:54'),(158,1,'남양주 글램핑','.','B2','camping.jpg','20230612_02041289525.jpg',0,'Y','2023-06-12 02:04:12','2023-06-12 02:04:12'),(159,1,'신길동 루카스 커피','.','B2','coffe.jpg','20230612_02042861626.jpg',0,'Y','2023-06-12 02:04:28','2023-06-12 02:04:28'),(160,1,'부산 롯데월드','.','B2','lotte.jpg','20230612_02044343427.jpg',0,'Y','2023-06-12 02:04:43','2023-06-12 02:04:43'),(161,1,'영도 스타벅스','.','B2','youngdo.jpg','20230612_02050004628.jpg',0,'Y','2023-06-12 02:05:00','2023-06-12 02:05:00'),(162,1,'지리산 스키장','.','B2','ski.jpg','20230612_02051372429.jpg',1,'Y','2023-06-12 02:05:13','2023-06-12 02:05:13'),(163,1,'경주 황리단길','.','B2','화면 캡처 2023-06-12 011959.jpg','20230612_02053018930.jpg',0,'Y','2023-06-12 02:05:30','2023-06-12 02:05:30'),(164,1,'경희대 캠퍼스 벚','.','B2','sakura.jpg','20230612_02055648731.jpg',0,'Y','2023-06-12 02:05:56','2023-06-12 02:05:56'),(165,1,'해운대 바다뷰 카페','.','B2','gijang.jpg','20230612_02063894632.jpg',2,'Y','2023-06-12 02:06:38','2023-06-12 02:06:38'),(166,1,'성심당 부띠끄','.','B2','sungsimdang.jpg','20230612_1128198040.jpg',1,'Y','2023-06-12 11:28:19','2023-06-12 11:28:19'),(167,1,'강원도 스키장','야간스키','B2','ski.jpg','20230612_1324035470.jpg',2,'Y','2023-06-12 13:24:03','2023-06-12 13:24:03');



COMMIT;
SELECT * FROM BOARD;

------------------------------------------------------------------
------------------------- REPLY 관련 테이블 -------------------------
------------------------------------------------------------------


CREATE TABLE REPLY(
  rNO INT PRIMARY KEY AUTO_INCREMENT,
  bNO INT,
  mNO INT,
  CONTENT VARCHAR(1000),
  STATUS VARCHAR(1) DEFAULT 'Y' CHECK (STATUS IN ('Y', 'N')),
  CREATE_DATE DATETIME DEFAULT CURRENT_TIMESTAMP,
  MODIFY_DATE DATETIME DEFAULT CURRENT_TIMESTAMP,
  FOREIGN KEY (bNO) REFERENCES BOARD(bNO),
  FOREIGN KEY (mNO) REFERENCES MEMBER(mNO)
);



INSERT INTO REPLY VALUES(0, 1, 1, '안녕하세요.', DEFAULT, DEFAULT, DEFAULT);
INSERT INTO REPLY VALUES(0, 1, 1, '반갑습니다.', DEFAULT, DEFAULT, DEFAULT);
INSERT INTO REPLY VALUES(0, 2, 1, '안녕하세요.', DEFAULT, DEFAULT, DEFAULT);
INSERT INTO REPLY VALUES(0, 2, 1, '반갑습니다.', DEFAULT, DEFAULT, DEFAULT);
INSERT INTO REPLY VALUES(0, 3, 1, '안녕하세요.', DEFAULT, DEFAULT, DEFAULT);
INSERT INTO REPLY VALUES(0, 3, 1, '반갑습니다.', DEFAULT, DEFAULT, DEFAULT);


COMMIT;

SELECT * FROM REPLY;



drop table booking;

CREATE TABLE Booking(
	bkNo INT AUTO_INCREMENT,
    mNO int,
	contentid    int,
    startDate DATETIME,
    endDate DATETIME,
    headCount int,
	PRIMARY KEY (bkNo),
    FOREIGN KEY(mNO) REFERENCES MEMBER(mNO)
);

select * from Booking;

INSERT INTO BOOKING VALUES(DEFAULT, 1, 2913612, "2021-06-12 00:00:00", "2021-06-14 00:00:00", 1);
INSERT INTO BOOKING VALUES(DEFAULT, 1, 2843606, "2022-06-12 00:00:00", "2023-02-14 00:00:00", 1);
INSERT INTO BOOKING VALUES(DEFAULT, 1, 2818337, "2023-06-12 00:00:00", "2023-06-14 00:00:00", 1);
INSERT INTO BOOKING VALUES(DEFAULT, 1, 2779506, "2024-06-12 00:00:00", "2024-06-14 00:00:00", 1);